---
type: SSEPointVisibilitySettings
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# SSEPointVisibilitySettings

`Autodesk.Revit.DB.SSEPointVisibilitySettings` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetVisibility | 2024 | `public static bool GetVisibility ( Document document , ElementId categoryId )` |
| Method | SetVisibility | 2024 | `public static void SetVisibility ( Document document , ElementId categoryId , bool isVisible )` |
| Property | Parameter | — | `` |